## Option 1 PyBank
### Loading Data in

In [302]:
import pandas as pd
budget_data_1=pd.read_csv('budget_data_1.csv',sep=',')
budget_data_2=pd.read_csv('budget_data_2.csv',sep=',')

In [303]:
budget_data= pd.concat([budget_data_1,budget_data_2])
budget_data.head()

     Date  Revenue
0  Oct-12  1154293
1  Nov-12   885773
2  Dec-12  -448704
3  Jan-13   563679
4  Feb-13   555394

### Changing Data Format to make them all uniform

In [305]:
Data=budget_data['Date'].replace({'-20':'-'}, regex=True)
Data_org=pd.concat([Data,budget_data['Revenue']], axis=1)
Data_org2=Data_org.groupby(['Date']).agg('sum')
Data_org2=Data_org2.reset_index()
Data_org2.head()

     Date  Revenue
0  Apr-09  -735286
1  Apr-10   120968
2  Apr-11   110092
3  Apr-12   594289
4  Apr-13  1482637

### Converting string Date to Number Date

In [306]:
list_a=[]
for x in Data_org2['Date']:
  
    if 'Jan' in x:
        a='01'
        list_a.append('20'+ x[-2:] +a )
    elif 'Feb' in x:
        a='02'
        list_a.append('20'+ x[-2:] +a )
    elif 'Mar' in x:
        a='03'
        list_a.append('20'+ x[-2:] +a )
    elif 'Apr' in x:
        a='04'
        list_a.append('20'+ x[-2:] +a )
    elif 'May' in x:
        a='05'
        list_a.append('20'+ x[-2:] +a )
    elif 'Jun' in x:
        a='06'
        list_a.append('20'+ x[-2:] +a )
    elif 'Jul' in x:
        a='07'
        list_a.append('20'+ x[-2:] +a )
    elif 'Aug' in x:
        a='08'
        list_a.append('20'+ x[-2:] +a )
    elif 'Sep' in x:
        a='09'
        list_a.append('20'+ x[-2:] +a )
    elif 'Oct' in x:
        a='10'
        list_a.append('20'+ x[-2:] +a )
    elif 'Nov' in x:
        a='11'
        list_a.append('20'+ x[-2:] +a )
    elif 'Dec' in x:
        a='12'
        list_a.append('20'+ x[-2:] +a )

In [307]:
list_a2=pd.DataFrame(list_a)

In [308]:
Data_org2=pd.concat([Data_org2,list_a2], axis=1)
Data_org2=Data_org2.rename(columns={0:"Date2"})

In [309]:
Data_org2=Data_org2.sort_values(['Date2'])

In [310]:
Data_org2=Data_org2.reset_index()
del Data_org2['index']
#Data_org2_copy=Data_org2[:]
Data_org2.head()

     Date  Revenue   Date2
0  Jan-09   943690  200901
1  Feb-09  1062565  200902
2  Mar-09   210079  200903
3  Apr-09  -735286  200904
4  May-09   842933  200905

In [311]:
d={"diff":range(len(Data_org2))}
d['diff'] = Data_org2['Revenue'] - Data_org2['Revenue'].shift(1)

In [313]:
d2=pd.DataFrame(d)
Data_org_final=pd.concat([Data_org2,d2],axis=1)
Data_org_final.head()

     Date  Revenue   Date2       diff
0  Jan-09   943690  200901        NaN
1  Feb-09  1062565  200902   118875.0
2  Mar-09   210079  200903  -852486.0
3  Apr-09  -735286  200904  -945365.0
4  May-09   842933  200905  1578219.0

### Getting Final Summary

In [314]:
Total_Month=Data_org_final['Date'].count()
Total_Revenue=Data_org_final['Revenue'].sum()
Average_Revenue_Change=Data_org_final['diff'].mean()
Greatest_Increase=Data_org_final['diff'].max()
Greatest_Decrease=Data_org_final['diff'].min()

In [316]:
Final_Analysis=pd.DataFrame({'Total_Month':[Total_Month],
                             'Total_Revenue':[Total_Revenue],
                             'Average_Revenue_Change':[Average_Revenue_Change],
                             'Greatest_Increase':[Greatest_Increase],
                             'Greatest_Decrease':[Greatest_Decrease]
                             })
Final_Analysis=Final_Analysis.transpose()
Final_Analysis.columns=['Analysis']
Final_Analysis=Final_Analysis.round({'Analysis': 0})
Final_Analysis

                          Analysis
Average_Revenue_Change      4444.0
Greatest_Decrease       -2293129.0
Greatest_Increase        2214907.0
Total_Month                   86.0
Total_Revenue           55945323.0